case/0/d.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      d.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
6144
(
0.007
0.007
0.007
0.007
0.007
0.007
0.007
0.007
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           uniform 0.007;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.005;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
3903
(
0.007
0.007
0.007
0.007
0.007
0.007
0.007
0.007
...
)
;
    }
}


// ************************************************************************* //
